{
  "file_info": {
    "original_file": "/Users/Alexis/Desktop/githubroot/github/youtube/videos/WhatsApp Video 2025-08-16 at 18.05.00 (1).mp4",
    "file_type": "video",
    "processed_date": "2025-08-17T08:15:14.875158",
    "file_size_mb": 2.36
  },
  "transcription": {
    "language": "en",
    "duration_seconds": 30.77,
    "full_text": "Two daughters, correct? Yeah, beautiful daughters. Would you want them to be happy? No, I want them to be productive and they will be happy to the degree they're productive. If they're free lovers in society, they will not be happy no matter how much money you do. No matter what their car looks like, their room looks like, their clothes look like, if they're not productive members contributing to society, it is impossible to be happy. I don't know anybody that is happy without being productive. What would you say to someone now who's unhappy with their life? And they want to change things around? I would tell them to quit seeking happiness and start seeking productivity and contribution and help in other people.",
    "raw_text": "Two daughters, correct? Yeah, beautiful daughters. Would you want them to be happy? No, I want them to be productive and they will be happy to the degree they're productive. If they're free lovers in society, they will not be happy no matter how much money you do. No matter what their car looks like, their room looks like, their clothes look like, if they're not productive members contributing to society, it is impossible to be happy. I don't know anybody that is happy without being productive. What would you say to someone now who's unhappy with their life? And they want to change things around? I would tell them to quit seeking happiness and start seeking productivity and contribution and help in other people.",
    "segments": [
      {
        "id": 0,
        "start": 0.0,
        "end": 3.6,
        "text": "Two daughters, correct? Yeah, beautiful daughters. Would you want them to be happy?"
      },
      {
        "id": 1,
        "start": 3.6,
        "end": 7.2,
        "text": "No, I want them to be productive and they will be happy to the degree they're productive."
      },
      {
        "id": 2,
        "start": 7.2,
        "end": 10.56,
        "text": "If they're free lovers in society, they will not be happy no matter how much money you do."
      },
      {
        "id": 3,
        "start": 10.56,
        "end": 13.84,
        "text": "No matter what their car looks like, their room looks like, their clothes look like,"
      },
      {
        "id": 4,
        "start": 13.84,
        "end": 17.84,
        "text": "if they're not productive members contributing to society, it is impossible to be happy."
      },
      {
        "id": 5,
        "start": 17.84,
        "end": 20.8,
        "text": "I don't know anybody that is happy without being productive."
      },
      {
        "id": 6,
        "start": 20.8,
        "end": 23.6,
        "text": "What would you say to someone now who's unhappy with their life?"
      },
      {
        "id": 7,
        "start": 23.6,
        "end": 24.88,
        "text": "And they want to change things around?"
      },
      {
        "id": 8,
        "start": 24.88,
        "end": 28.64,
        "text": "I would tell them to quit seeking happiness and start seeking productivity"
      },
      {
        "id": 9,
        "start": 28.64,
        "end": 30.64,
        "text": "and contribution and help in other people."
      }
    ]
  },
  "analysis": {
    "text_stats": {
      "character_count": 721,
      "word_count": 125,
      "sentence_count": 10
    },
    "keywords": [
      "happy",
      "productive",
      "would",
      "want",
      "like",
      "daughters",
      "society",
      "matter",
      "looks",
      "seeking"
    ],
    "extractive_summary": "Would you want them to be happy? No, I want them to be productive and they will be happy to the degree they're productive. If they're free lovers in society, they will not be happy no matter how much money you do. No matter what their car looks like, their room looks like, their clothes look like, if they're not productive members contributing to society, it is impossible to be happy. I don't know anybody that is happy without being productive.",
    "topic_summary": {
      "Tema 1: happy, productive": "Would you want them to be happy? No, I want them to be productive and they will be happy to the degree they're productive."
    }
  }
}